---
kind: type
id: T:Autodesk.Revit.DB.DetailElementOrderUtils
source: html/7153db7b-62cc-f36b-b6a5-0ded8af7b5be.htm
---
# Autodesk.Revit.DB.DetailElementOrderUtils

A utility class that arranges the draw order of the detail elements.

## Syntax (C#)
```csharp
public static class DetailElementOrderUtils
```